"""
Конфигурация фильтров для постов
Здесь можно добавлять/удалять разрешенные хештеги, запрещенные слова и блокировать пользователей
"""

#Список разрешенных хештегов для пересылки
ALLOWED_HASHTAGS = [
    "#ᴩᴀᴄᴄʍᴀᴛᴩиʙᴀюᴨᴩᴇдᴧожᴇниянᴀᴧоɯᴀдь",
    "#ᴀуᴋционᴧоɯᴀди",
    "#ᴨᴩодᴀжᴀᴧоɯᴀди",
    "#оᴛᴋᴩыᴛᴨоиᴄᴋᴧоɯᴀди",
    "#ᴩᴀᴄᴄʍᴀᴛᴩиʙᴀюᴨᴩᴇдᴧожᴇниянᴀʙᴇщь",
    "#ᴀуᴋционʙᴇщи",
    "#ᴨᴩодᴀжᴀʙᴇщи",
    "#ᴨоиᴄᴋʙᴇщи",
    "#ᴨᴩодᴀжᴀуᴄᴧуᴦи",
    "#ᴨоиᴄᴋуᴄᴧуᴦи",
]

#Ключевые слова, которые должны присутствовать в посте
REQUIRED_KEYWORDS = [
    "~ 𝐀𝐩𝐩𝐥𝐞 𝐆𝐨𝐥𝐝 ~",
    "~ 𝓐𝓹𝓹𝓵𝓮 𝓖𝓸𝓵𝓭 ~",
    "~ Apple Gold ~",
]

#Запрещенные люди/боты
BLOCKED_USERS = [
    "5226378684",
    "iris_dp_bot",
    "@iris_dp_bot",
]

#Запрещенные слова
BANNED_WORDS = [
    "Заметка",
    "Бемби",
    "Бэмби",
    "Хазе",
    "Канал",
    "канале",
    "🗓",
]
